neddy299/M1/Esp_spi_at/examples/at_spi_master/spi/stm32/main/m1_at_response_parser.c
/* See COPYING.txt for license details. */

/*
*
* m1_at_response_parser.c
*
* M1 parser for EPS32 module
*
* M1 Project
*
*/

/*************************** I N C L U D E S **********************************/

#include <stdint.h>
#include <string.h>
#include <stdlib.h>
#include "stm32h5xx_hal.h"
#include "main.h"
#include "ctrl_api.h"
#include "m1_compile_cfg.h"
#include "m1_at_response_parser.h"

/*************************** D E F I N E S ************************************/

#define CHECK_NON_ZERO_VAL(x)		{if (!x) break;}

//************************** C O N S T A N T **********************************/

//************************** S T R U C T U R E S *******************************


/***************************** V A R I A B L E S ******************************/


/********************* F U N C T I O N   P R O T O T Y P E S ******************/


/*************** F U N C T I O N   I M P L E M E N T A T I O N ****************/

/******************************************************************************/
/**
  * @brief
  * @param None
  * @retval None
  */
/******************************************************************************/
char *m1_resp_string_strip(char *resp, const char *substr)
{
	size_t sublen;
	char *index;

	if ( !resp )
		return NULL;
    sublen = strlen(substr);
    if (sublen > 0)
    {
        index = resp;
        while (true)
        {
        	index = strstr(index, substr);
        	if ( !index )
        		break;
            memmove(index, index + sublen, strlen(index + sublen) + 1);
        }
    } // if (sublen > 0)

    return resp;
} // char *m1_resp_string_strip(char *resp, const char *substr)



/******************************************************************************/
/**
  * @brief
  * @param None
  * @retval None
  */
/******************************************************************************/
uint8_t m1_parse_spi_at_resp(char *resp, const char *resp_key, ctrl_cmd_t *app_resp)
{
	uint8_t ret = ERROR;
	char *index, *start_index, *end_index, *next_index;
	uint16_t ap_count = 0xFFFF;
	size_t cp_len;
	wifi_scanlist_t *out_list;
	do
	{
		CHECK_NON_ZERO_VAL(resp);
		CHECK_NON_ZERO_VAL(resp_key);
		CHECK_NON_ZERO_VAL(app_resp);
		CHECK_NON_ZERO_VAL(strlen(resp_key));
		CHECK_NON_ZERO_VAL(strlen(resp));
		index = strstr(resp, resp_key);
		CHECK_NON_ZERO_VAL(index);
		switch (app_resp->msg_id)
		{
			case CTRL_RESP_GET_AP_SCAN_LIST:
				// +CWLAP:(<ecn>,<"ssid">,<rssi>,<"mac">,<channel>,<freq_offset>,<freqcal_val>,<pairwise_cipher>,<group_cipher>,<bgn>,<wps>)
				//Sample response: +CWLAP:(3,"MySSIDname",-73,"1a:2b:3c:4d:56:78",10,-1,-1,4,4,7,1)
				ap_count = app_resp->u.wifi_ap_scan.count;
				out_list = app_resp->u.wifi_ap_scan.out_list;
				while ( true )
				{
					start_index = strstr(index, "(");
					if ( !start_index )
						break;
					end_index = strstr(index, ")");
					if ( !end_index )
						break;
					next_index = end_index;
					out_list = realloc(out_list, sizeof(wifi_scanlist_t)*(app_resp->u.wifi_ap_scan.count + 1));
					if ( out_list==NULL )
						break;
					out_list[app_resp->u.wifi_ap_scan.count].encryption_mode = strtol(&start_index[1], &start_index, 10);
					end_index = strstr(&start_index[2], "\"");
					cp_len = end_index - start_index - 2;
					strncpy(out_list[app_resp->u.wifi_ap_scan.count].ssid, &start_index[2], cp_len);
					out_list[app_resp->u.wifi_ap_scan.count].ssid[cp_len] = 0x00; // Add end of string
					out_list[app_resp->u.wifi_ap_scan.count].rssi = strtol(&end_index[2], &start_index, 10);
					end_index = strstr(&start_index[2], "\"");
					cp_len = end_index - start_index - 2;
					strncpy(out_list[app_resp->u.wifi_ap_scan.count].bssid, &start_index[2], cp_len);
					out_list[app_resp->u.wifi_ap_scan.count].bssid[cp_len] = 0x00;
					out_list[app_resp->u.wifi_ap_scan.count].channel = strtol(&end_index[2], &start_index, 10);

					app_resp->u.wifi_ap_scan.count++; // Increase count
					index = strstr(next_index, resp_key); // Try to get another record
					if (!index)
						break;
				} // while ( true )
				break;

			case CTRL_RESP_GET_BLE_SCAN_LIST:
				//+BLESCAN:"7c:0a:3f:9b:d5:cd",-81,1bff750042040180667c0a3f9bd5cd7e0a3f9bd5cc01000000000000,,0,3
				ap_count = app_resp->u.wifi_ap_scan.count;
				out_list = app_resp->u.wifi_ap_scan.out_list;
				while ( true )
				{
					start_index = strstr(index, "\"");
					if ( !start_index )
						break;
					end_index = strstr(index, "\r\n");
					if ( !end_index )
						break;
					next_index = end_index;
					out_list = realloc(out_list, sizeof(wifi_scanlist_t)*(app_resp->u.wifi_ap_scan.count + 1));
					if ( out_list==NULL )
						break;
					end_index = strstr(&start_index[1], "\"");
					cp_len = end_index - start_index - 1;
					strncpy(out_list[app_resp->u.wifi_ap_scan.count].bssid, &start_index[1], cp_len);
					out_list[app_resp->u.wifi_ap_scan.count].bssid[cp_len] = 0x00; // Add end of string
					out_list[app_resp->u.wifi_ap_scan.count].rssi = strtol(&end_index[2], &start_index, 10);
					end_index = strstr(&start_index[1], ",");
					end_index = strstr(&end_index[1], ",");
					out_list[app_resp->u.wifi_ap_scan.count].encryption_mode = strtol(&end_index[1], &start_index, 10);

					app_resp->u.wifi_ap_scan.count++; // Increase count
					index = strstr(next_index, resp_key); // Try to get another record
					if (!index)
						break;
				} // while ( true )
				break;

			default:
				break;
		} // switch (app_resp->msg_id)
	} while (0);

	if ( ap_count < app_resp->u.wifi_ap_scan.count )
	{
		ret = SUCCESS;
		app_resp->u.wifi_ap_scan.out_list = out_list; // Update
	}

	return ret;
} // uint8_t m1_parse_spi_at_resp(char *resp, const char *resp_key, ctrl_cmd_t *app_resp)



#ifdef M1_APP_BT_MANAGE_ENABLE

/******************************************************************************/
/**
  * @brief  Convert a hex character to its nibble value (0-15)
  */
/******************************************************************************/
static uint8_t hex_char_to_nibble(char c)
{
	if (c >= '0' && c <= '9') return c - '0';
	if (c >= 'a' && c <= 'f') return c - 'a' + 10;
	if (c >= 'A' && c <= 'F') return c - 'A' + 10;
	return 0;
}

/******************************************************************************/
/**
  * @brief  Convert two hex characters to a byte value
  */
/******************************************************************************/
static uint8_t hex_pair_to_byte(const char *hex)
{
	return (hex_char_to_nibble(hex[0]) << 4) | hex_char_to_nibble(hex[1]);
}

/******************************************************************************/
/**
  * @brief  Parse BLE advertisement data hex string for device name
  *         Searches AD structures for type 0x08 (Shortened) or 0x09 (Complete)
  *         Local Name.
  * @param  hex_data: hex-encoded advertisement data string
  * @param  name_out: output buffer for decoded name
  * @param  max_len: size of name_out buffer
  */
/******************************************************************************/
static void ble_parse_adv_name(const char *hex_data, char *name_out, size_t max_len)
{
	size_t hex_len;
	size_t i, j, hex_off;
	uint8_t ad_len, ad_type;
	size_t name_len;
	char ch;

	name_out[0] = '\0';
	if (!hex_data || !hex_data[0]) return;

	hex_len = strlen(hex_data);
	if (hex_len < 4) return;  /* minimum: 2 hex for len + 2 hex for type */

	i = 0;
	while (i + 3 < hex_len)
	{
		ad_len = hex_pair_to_byte(&hex_data[i]);
		if (ad_len == 0) break;
		if (i + 2 + (size_t)ad_len * 2 > hex_len) break;  /* not enough data */

		ad_type = hex_pair_to_byte(&hex_data[i + 2]);

		if (ad_type == 0x08 || ad_type == 0x09)  /* Shortened or Complete Local Name */
		{
			name_len = ad_len - 1;  /* subtract type byte */
			if (name_len >= max_len) name_len = max_len - 1;
			for (j = 0; j < name_len; j++)
			{
				hex_off = i + 4 + j * 2;  /* skip len(2) + type(2) + j*2 */
				ch = (char)hex_pair_to_byte(&hex_data[hex_off]);
				if (ch == '\0') break;
				/* Only keep printable ASCII characters */
				if (ch >= 0x20 && ch <= 0x7E)
					name_out[j] = ch;
				else
					name_out[j] = '?';
			}
			name_out[j] = '\0';
			return;
		}

		i += 2 + (size_t)ad_len * 2;  /* skip len byte + ad_len data bytes */
	}
} // static void ble_parse_adv_name(...)


/******************************************************************************/
/**
  * @brief  Parse BLE scan responses into ble_scan_list_t with device names
  *         and MAC deduplication.
  *         Format: +BLESCAN:"MAC",RSSI,adv_data,scan_rsp_data,addr_type,evt_type
  * @param  resp: AT response string
  * @param  resp_key: response key to look for ("+BLESCAN:")
  * @param  app_resp: ctrl_cmd_t with ble_scan union member
  * @retval SUCCESS or ERROR
  */
/******************************************************************************/
uint8_t m1_parse_ble_scan_resp(char *resp, const char *resp_key, ctrl_cmd_t *app_resp)
{
	uint8_t ret = ERROR;
	char *index, *start_index, *mac_end, *line_end, *next_index;
	char *comma1, *comma2, *comma3;
	uint16_t prev_count;
	ble_scanlist_t *out_list;
	char name_buf[SSID_LENGTH];
	char mac_buf[BSSID_STR_SIZE];
	int i, found_idx;
	size_t cp_len, field_len;
	int rssi;
	uint8_t addr_type;

	if (!resp || !resp_key || !app_resp) return ERROR;
	if (!strlen(resp_key) || !strlen(resp)) return ERROR;

	index = strstr(resp, resp_key);
	if (!index) return ERROR;

	prev_count = app_resp->u.ble_scan.count;
	out_list = app_resp->u.ble_scan.out_list;

	while (1)
	{
		/* Find MAC address between quotes */
		start_index = strstr(index, "\"");
		if (!start_index) break;
		line_end = strstr(index, "\r\n");
		if (!line_end) break;
		next_index = line_end;

		/* Extract MAC */
		mac_end = strstr(&start_index[1], "\"");
		if (!mac_end || mac_end > line_end) break;
		cp_len = mac_end - start_index - 1;
		if (cp_len >= BSSID_STR_SIZE) cp_len = BSSID_STR_SIZE - 1;
		strncpy(mac_buf, &start_index[1], cp_len);
		mac_buf[cp_len] = '\0';

		/* Extract RSSI */
		rssi = strtol(&mac_end[2], &start_index, 10);

		/* Find commas for fields 3 (adv_data), 4 (scan_rsp_data), 5 (addr_type) */
		/* start_index now points to comma after RSSI */
		comma1 = strstr(start_index, ",");
		if (!comma1 || comma1 > line_end) break;
		comma1++;  /* start of field 3 (adv_data) */

		comma2 = strstr(comma1, ",");
		if (!comma2 || comma2 > line_end) break;
		/* field 3 = adv_data runs from comma1 to comma2 */

		/* Try to parse name from adv_data (field 3) */
		name_buf[0] = '\0';
		field_len = comma2 - comma1;
		if (field_len >= 4)
		{
			char saved = *comma2;
			*comma2 = '\0';
			ble_parse_adv_name(comma1, name_buf, SSID_LENGTH);
			*comma2 = saved;
		}

		/* Field 4 (scan_rsp_data): after comma2 to next comma */
		comma3 = strstr(comma2 + 1, ",");
		if (!comma3 || comma3 > line_end) break;

		/* Try scan_rsp_data for name if not found in adv_data */
		if (name_buf[0] == '\0')
		{
			field_len = comma3 - (comma2 + 1);
			if (field_len >= 4)
			{
				char saved = *comma3;
				*comma3 = '\0';
				ble_parse_adv_name(comma2 + 1, name_buf, SSID_LENGTH);
				*comma3 = saved;
			}
		}

		/* Field 5 (addr_type) */
		addr_type = (uint8_t)strtol(comma3 + 1, NULL, 10);

		/* Check if this MAC already exists (dedup) */
		found_idx = -1;
		for (i = 0; i < app_resp->u.ble_scan.count; i++)
		{
			if (strcmp((char *)out_list[i].addr, mac_buf) == 0)
			{
				found_idx = i;
				break;
			}
		}

		if (found_idx >= 0)
		{
			/* Update existing: better RSSI, fill in name if missing */
			if (rssi > out_list[found_idx].rssi)
				out_list[found_idx].rssi = rssi;
			if (name_buf[0] != '\0' && out_list[found_idx].name[0] == '\0')
				strncpy((char *)out_list[found_idx].name, name_buf, SSID_LENGTH - 1);
		}
		else
		{
			/* Add new entry */
			out_list = realloc(out_list, sizeof(ble_scanlist_t) * (app_resp->u.ble_scan.count + 1));
			if (!out_list) break;

			strncpy((char *)out_list[app_resp->u.ble_scan.count].addr, mac_buf, BSSID_STR_SIZE - 1);
			out_list[app_resp->u.ble_scan.count].addr[BSSID_STR_SIZE - 1] = '\0';
			strncpy((char *)out_list[app_resp->u.ble_scan.count].name, name_buf, SSID_LENGTH - 1);
			out_list[app_resp->u.ble_scan.count].name[SSID_LENGTH - 1] = '\0';
			out_list[app_resp->u.ble_scan.count].rssi = rssi;
			out_list[app_resp->u.ble_scan.count].addr_type = addr_type;

			app_resp->u.ble_scan.count++;
		}

		/* Try to get another record */
		index = strstr(next_index, resp_key);
		if (!index) break;
	} // while (1)

	if (prev_count < app_resp->u.ble_scan.count)
	{
		ret = SUCCESS;
		app_resp->u.ble_scan.out_list = out_list;
	}
	else if (out_list && app_resp->u.ble_scan.count > 0)
	{
		/* Count didn't increase but we still have valid data (all dupes) */
		ret = SUCCESS;
		app_resp->u.ble_scan.out_list = out_list;
	}

	return ret;
} // uint8_t m1_parse_ble_scan_resp(...)

#endif /* M1_APP_BT_MANAGE_ENABLE */


/*
https://docs.espressif.com/projects/esp-at/en/latest/esp32/AT_Command_Set/BLE_AT_Commands.html#cmd-bscan

cli> mtest 70 0
CLI mtest: ESP32 - init esp32 module

cli> mtest 72 AT+BLEINIT=1
CLI mtest: ESP32 - send AT command

AT+BLEINIT=1

OK

cli> mtest 72 AT+BLESCAN=1,3
CLI mtest: ESP32 - send AT command

AT+BLESCAN=1,3

OK

+BLESCAN:"21:bb:62:d8:f0:6a",-82,1e16f3fe4a172345524e4611321e7207d8255b90bc8efe50d3eb09fcd01099,,1,3

+BLESCAN:"c0:f8:53:87:27:00",-76,,,0,0

+BLESCAN:"f4:dd:06:22:e4:42",-65,02011819ff7500021834a1208f1e623f908407618fcf8befd925fa59cc,,0,0
...
+BLESCAN:"74:38:b7:4e:84:d6",-87,,020a06031900021109454f5352365f46373444453600000000,0,4
...
+BLESCAN:"f4:dd:06:22:e4:42",-80,02011819ff7500021834a1208f1e623f908407618fcf8befd925fa59cc,,0,0
+BLESCAN:"f4:dd:06:22:e4:42",-80,,,0,4
...
+BLESCAN:"b0:99:d7:b2:b4:eb",-76,1bff75004204018066b099d7b2b4ebb299d7b2b4ea01000000000000,,0,3

+BLESCAN:"b0:99:d7:b2:47:7b",-86,1bff75004204018066b099d7b2477bb299d7b2477a01000000000000,,0,3

+BLESCAN:"2c:99:75:bc:8e:23",-82,1bff750042040180662c9975bc8e232e9975bc8e2201000000000000,,0,3

+BLESCAN:"74:38:b7:4e:84:d6",-88,020106110721a8ff2f49d80000001000000000010009ffa90101f532f7fe05,,0,0

+BLESCAN:"f4:dd:06:22:e4:42",-78,02011819ff7500021834a1208f1e623f908407618fcf8befd925fa59cc,,0,0
+BLESCAN:"f4:dd:06:22:e4:42",-78,,,0,4

+BLESCAN:"7c:0a:3f:9b:d5:cd",-81,1bff750042040180667c0a3f9bd5cd7e0a3f9bd5cc01000000000000,,0,3

+BLESCAN:"56:6b:e2:a4:f4:a3",-67,1eff060001092002b0a35bbb626d95882709bad08dd1022b29e29ddd98672a,,1,3

+BLESCAN:"e0:74:5f:8b:a7:61",-76,0201181bff750042098102141503210149e217012d06bcb09700000000a300,,1,2

+BLESCAN:"e0:74:5f:8b:a7:61",-74,,0909427564732050726f10ff750000d1744ef04e80656526000101,1,4

+BLESCAN:"f4:dd:06:22:e4:42",-72,02011819ff7500021834a1208f1e623f908407618fcf8befd925fa59cc,,0,0
+BLESCAN:"f4:dd:06:22:e4:42",-75,,,0,4

+BLESCAN:"b0:99:d7:b2:47:7b",-85,1bff75004204018066b099d7b2477bb299d7b2477a01000000000000,,0,3

+BLESCAN:"21:bb:62:d8:f0:6a",-79,1e16f3fe4a172345524e4611321e7207d8255b90bc8efe50d3eb09fcd01099,,1,3

+BLESCAN:"e0:74:5f:8b:a7:61",-80,0201181bff750042098102141503210149e217012d06bcb09700000000a300,,1,2

+BLESCAN:"e0:74:5f:8b:a7:61",-75,,0909427564732050726f10ff750000d1744ef04e80656526000101,1,4

+BLESCAN:"2c:99:75:bc:8e:23",-75,1bff750042040180662c9975bc8e232e9975bc8e2201000000000000,,0,3

+BLESCAN:"c0:f8:53:87:27:00",-58,,,0,0

+BLESCAN:"c0:f8:53:87:27:00",-64,,09ff006052572d424c45,0,4

+BLESCAN:"f4:dd:06:22:e4:42",-66,02011819ff7500021834a1208f1e623f908407618fcf8befd925fa59cc,,0,0
+BLESCAN:"f4:dd:06:22:e4:42",-66,,,0,4

+BLESCAN:"e0:74:5f:8b:a7:61",-82,0201181bff750042098102141503210149e217012d06bcb09700000000a300,,1,2

+BLESCAN:"e0:74:5f:8b:a7:61",-82,,0909427564732050726f10ff750000d1744ef04e80656526000101,1,4

+BLESCAN:"20:57:9e:2f:55:cf",-81,0201051106f6e01ce42c53a1960f4d79c2371ad92608094d79512d353734,,0,0
+BLESCAN:"20:57:9e:2f:55:cf",-81,,0319000005ff78082200,0,4

+BLESCAN:"7c:0a:3f:9b:d5:cd",-74,1bff750042040180667c0a3f9bd5cd7e0a3f9bd5cc01000000000000,,0,3

+BLESCAN:"56:6b:e2:a4:f4:a3",-57,1eff060001092002b0a35bbb626d95882709bad08dd1022b29e29ddd98672a,,1,3

+BLESCAN:"b0:99:d7:b2:b4:eb",-75,1bff75004204018066b099d7b2b4ebb299d7b2b4ea01000000000000,,0,3

+BLESCAN:"e0:74:5f:8b:a7:61",-80,0201181bff750042098102141503210149e217012d06bcb09700000000a300,,1,2

+BLESCAN:"e0:74:5f:8b:a7:61",-75,,0909427564732050726f10ff750000d1744ef04e80656526000101,1,4

+BLESCAN:"c0:f8:53:87:27:00",-58,,,0,0

+BLESCAN:"2c:99:75:bc:8e:23",-71,1bff750042040180662c9975bc8e232e9975bc8e2201000000000000,,0,3

+BLESCAN:"f4:dd:06:22:e4:42",-81,02011819ff7500021834a1208f1e623f908407618fcf8befd925fa59cc,,0,0
+BLESCAN:"f4:dd:06:22:e4:42",-81,,,0,4

+BLESCAN:"20:57:9e:2f:55:cf",-79,0201051106f6e01ce42c53a1960f4d79c2371ad92608094d79512d353734,,0,0

+BLESCAN:"20:57:9e:2f:55:cf",-77,,0319000005ff78082200,0,4

+BLESCAN:"56:6b:e2:a4:f4:a3",-57,1eff060001092002b0a35bbb626d95882709bad08dd1022b29e29ddd98672a,,1,3

+BLESCAN:"f4:dd:06:22:e4:42",-69,0201181bff75004204018067f4dd0622e442f6dd0622e44130000000000000,,0,0

+BLESCAN:"f4:dd:06:22:e4:42",-70,,1008353022204372797374616c20554844,0,4

+BLESCAN:"e0:74:5f:8b:a7:61",-77,0201181bff750042098102141503210149e217012d06bcb09700000000a300,,1,2

+BLESCAN:"e0:74:5f:8b:a7:61",-82,,0909427564732050726f10ff750000d1744ef04e80656526000101,1,4

+BLESCAN:"56:6b:e2:a4:f4:a3",-70,1eff060001092002b0a35bbb626d95882709bad08dd1022b29e29ddd98672a,,1,3

+BLESCAN:"b0:99:d7:b2:b4:eb",-73,1bff75004204018066b099d7b2b4ebb299d7b2b4ea01000000000000,,0,3

+BLESCAN:"e0:74:5f:8b:a7:61",-76,0201181bff750042098102141503210149e217012d06bcb09700000000a300,,1,2

+BLESCAN:"e0:74:5f:8b:a7:61",-78,,0909427564732050726f10ff750000d1744ef04e80656526000101,1,4
+BLESCAN:"b0:99:d7:b2:47:7b",-88,1bff75004204018066b099d7b2477bb299d7b2477a01000000000000,,0,3

+BLESCAN:"2c:99:75:bc:8e:23",-81,1bff750042040180662c9975bc8e232e9975bc8e2201000000000000,,0,3

+BLESCAN:"c0:f8:53:87:27:00",-58,,,0,0

+BLESCAN:"56:6b:e2:a4:f4:a3",-69,1eff060001092002b0a35bbb626d95882709bad08dd1022b29e29ddd98672a,,1,3

+BLESCAN:"b0:99:d7:b2:47:7b",-84,1bff75004204018066b099d7b2477bb299d7b2477a01000000000000,,0,3

+BLESCAN:"c0:f8:53:87:27:00",-64,,09ff006052572d424c45,0,4
+BLESCAN:"20:57:9e:2f:55:cf",-92,0201051106f6e01ce42c53a1960f4d79c2371ad92608094d79512d353734,,0,0

+BLESCAN:"b0:99:d7:b2:b4:eb",-74,1bff75004204018066b099d7b2b4ebb299d7b2b4ea01000000000000,,0,3

+BLESCANDONE
 */


